<?php

return [
    'registration_resubmitted_successfully' => 'تم إعادة تقديم التسجيل بنجاح.',
    'registration_completed' => 'شكرًا لإكمال عملية التسجيل! حسابك الآن قيد الموافقة. سنقوم بمراجعة معلوماتك قريبًا وسنرسل لك بريدًا إلكترونيًا بالتعليمات اللاحقة. يرجى تذكر التحقق من بريدك الإلكتروني، بما في ذلك مجلد البريد العشوائي، للحصول على التحديثات.',
    'registration_rejected' => 'تم رفض تسجيل البائع. في هذه الحالة، يمكنك تحديث نموذج التسجيل وإعادة تقديمه للمراجعة. عند إعادة التقديم، سيتغير الحالة إلى "قيد الموافقة". يرجى التأكد من إعادة تقديم التسجيل في غضون 30 يومًا، وإلا سيتم حذف حسابك تلقائيًا.',
    'pending_closure' => 'حسابك يتمتع حالياً بحالة الإغلاق المعلقة. هذا يعني أن حسابك معلق بنية إغلاقه. إذا قمت بحل أي قضايا معلقة أو مسائل مالية معلقة، قد يتم تمكين حسابك مرة أخرى. يرجى التواصل مع إدارة MawadOnline لمزيد من المساعدة.',
    'vendor_closed' => 'تم إغلاق حساب البائع الخاص بك. إذا كان لديك أي أسئلة أو استفسارات، يرجى الاتصال بدعم مواد أونلاين.',
    'suspended' => 'تم تعليق حساب البائع الخاص بك بواسطة المسؤول. يرجى مراجعة الأسباب المحددة للتعليق والتفاصيل في الصفحة الخاصة بك. إذا كان لديك أي استفسارات، يرجى الاتصال بدعم مواد أونلاين.',
    'approved' => 'تمت الموافقة على حسابك كبائع بنجاح. مبروك! يمكنك الآن تسجيل الدخول إلى حسابك في MawadOnline وبدء بيع منتجاتك.',
    'reason' => 'السبب:',
    'details' => 'التفاصيل:',
    'thank_you' => 'شكرًا لاستخدامك Mawad Online!',

];
